app/controllers/city_controller.rb

INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "London"], ["short_name", "Ld"], ["created_at", "2015-02-24 09:09:55.394876"], ["updated_at", "2015-02-24 09:09:55.394876"]]
---
  def create
    @city = City.new(params.require(:city).permit(:name, :short_name))
    @city.save

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cities" SET "name" = ?, "short_name" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["name", "Berlin"], ["short_name", "Br"], ["updated_at", "2015-02-24 09:35:26.417066"], ["id", 1]]
---
  def update
    @city = City.find(params[:id])

    if @city.update(params.require(:city).permit(:name, :short_name))

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @city = City.find(params[:id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 4]]
---
  def destroy
    @city = City.find(params[:id])
    @city.destroy