app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(:page=>params[:page], :per_page=>4)